// البيانات الخاصة بالاقتباسات
List quotes_data = [
  {
    "id": 1,
    "quote": "إن معظم العملاء غير الراضين هم أعظم مصدر للتعلم.",
    "author": "بيل غيتس",
    "color_id": 8
  },
  {
    "id": 2,
    "quote":
        "إذا نظرنا إلى القرن القادم ، فسيكون القادة هم الذين يمكّنون الآخرين.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 3,
    "quote": "للفوز كبيرة ، في بعض الأحيان تحتاج إلى اتخاذ مخاطر كبيرة.",
    "author": "بيل غيتس",
    "color_id": 3
  },
  {
    "id": 4,
    "quote":
        "كن لطيفا مع المهووسين. الشيء الأكثر احتمالا هو أن ينتهي بك المطاف في العمل لواحد.",
    "author": "بيل غيتس",
    "color_id": 8
  },
  {
    "id": 5,
    "quote": "لم أحضر يومًا في العشرينات من عمري.",
    "author": "بيل غيتس",
    "color_id": 5
  },
  {
    "id": 6,
    "quote":
        "كان لدي العديد من الأحلام عندما كنت طفلاً ، وأعتقد أن الكثير قد نما من حقيقة أنني أتيحت لي الفرصة لقراءة الكثير.",
    "author": "بيل غيتس",
    "color_id": 8
  },
  {
    "id": 7,
    "quote":
        "كن Google أو Apple أو برمجيات حرة ، لدينا منافسين رائعين والتي تبقي أقدامنا على الأرض.",
    "author": "بيل غيتس",
    "color_id": 9
  },
  {
    "id": 8,
    "quote": "الفكرة العامة للرجل الغني الذي يساعد الفقراء ، أعتقد ، مهمة.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 9,
    "quote": "إن تغير المناخ مشكلة فظيعة ، ويجب حلها. إنه يستحق أولوية كبيرة.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 10,
    "quote":
        " يجب علينا جميعا أن نمتلك طعامنا ونقوم بمعالجة النفايات الخاصة بنا.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 11,
    "quote": " البرنامج هو مزيج رائع بين الفن والهندسة.",
    "author": "بيل غيتس",
    "color_id": 5
  },
  {
    "id": 12,
    "quote":
        "- تحدث تسعون في المائة من حالات شلل الأطفال في المناطق المعرضة للخطر.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 13,
    "quote":
        " احصل على المزيد من الرسائل غير المرغوب فيها أكثر من جميع الأشخاص الذين أعرفهم.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 14,
    "quote": " بالنسبة لأفريقيا للمضي قدما ، يجب عليك حقا التخلص من الملاريا.",
    "author": "بيل غيتس",
    "color_id": 3
  },
  {
    "id": 15,
    "quote":
        " لقد كنت محظوظة للغاية ، ولهذا السبب لدي التزام بالحد من عدم المساواة في العالم. إنه شكل من أشكال المعتقد الديني.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 16,
    "quote": "- تحسين الصحة وتمكين المرأة والنمو السكاني آخذ في الانخفاض.",
    "author": "بيل غيتس",
    "color_id": 8
  },
  {
    "id": 17,
    "quote":
        " من الأسهل إضافة أشياء لجهاز الكمبيوتر أكثر من أي وقت مضى. مع بنقرة واحدة فقط وذراع! ، يظهر.",
    "author": "بيل غيتس",
    "color_id": 7
  },
  {
    "id": 18,
    "quote": " يجب أن يكون العمل الخيري تطوعيًا.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 19,
    "quote":
        " الآن ، في أي وظيفة تقريبا يستخدم الناس البرمجيات والعمل مع المعلومات للسماح لمنظمتهم للعمل بشكل أكثر فعالية.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 20,
    "quote":
        " لا يعني أن تغمرنا بالمعلومات أن لدينا المعلومات الصحيحة أو أننا على اتصال بالأشخاص المناسبين.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 21,
    "quote": " أكثر المحسنين خيراً هم الأشخاص الذين يقدمون تضحيات كبيرة.",
    "author": "بيل غيتس",
    "color_id": 9
  },
  {
    "id": 22,
    "quote":
        " يمكن أن يأخذ رأس المال الخاص المخاطر التي لا يرغب رأس المال العام في تحملها.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 23,
    "quote":
        " يشبه الحمض النووي (DNA) برنامجًا للحاسوب ، لكنه أكثر تقدمًا بكثير من أي برنامج تم إنشاؤه.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 24,
    "quote":
        " أتفق مع أشخاص مثل ريتشارد دوكينز أن البشرية شعرت بالحاجة إلى خلق الأساطير. قبل أن نبدأ بالفعل بفهم الأمراض والطقس وأشياء من هذا القبيل ، بحثنا عن تفسيرات زائفة.",
    "author": "بيل غيتس",
    "color_id": 8
  },
  {
    "id": 25,
    "quote":
        " بيع في متجر ، والعمل في مطعم ، مما يجعل الهامبرغر ... لا شيء من ذلك يقلل من كرامتك. اسم ذلك هو \"فرصة\"",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 26,
    "quote":
        " عندما يكون لديك المال في يدك ، أنت فقط نسيت من أنت. ولكن عندما لا يكون لديك مال في يدك ، ينسى الجميع من أنت. هكذا هي الحياة.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 27,
    "quote": " لا أعرف ما إذا كان هناك إله أم لا ...",
    "author": "بيل غيتس",
    "color_id": 7
  },
  {
    "id": 28,
    "quote":
        " بعض الناس قد اتصل بي الطالب الذي يذاكر كثيرا. أدعي التسمية بكل فخر.",
    "author": "بيل غيتس",
    "color_id": 7
  },
  {
    "id": 29,
    "quote": " العمل هو لعبة المال مع قواعد قليلة والكثير من المخاطر.",
    "author": "بيل غيتس",
    "color_id": 6
  },
  {
    "id": 30,
    "quote":
        " هذا وقت رائع لدخول عالم الأعمال ، لأن الأعمال سوف تتغير أكثر في السنوات العشر القادمة أكثر من 50 سنة الأخيرة.",
    "author": "بيل غيتس",
    "color_id": 9
  },
  {
    "id": 31,
    "quote": " نعم ، يمكنك تعلم أي شيء.",
    "author": "بيل غيتس",
    "color_id": 4
  },
  {
    "id": 32,
    "quote": " أعتقد أن العمل بسيط للغاية.",
    "author": "بيل غيتس",
    "color_id": 3
  },
  {
    "id": 33,
    "quote": "- الصبر عنصر أساسي في النجاح.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 34,
    "quote":
        " النجاح هو المعلم الرديء. إغراء الأذكياء على الرغم من عدم القدرة على الخسارة.",
    "author": "بيل غيتس",
    "color_id": 7
  },
  {
    "id": 35,
    "quote": " \"أنا لا أعرف\" أصبح \"لا أعرف حتى الآن\".",
    "author": "بيل غيتس",
    "color_id": 4
  },
  {
    "id": 36,
    "quote": " الحياة ليست عادلة ، تعتاد عليها.",
    "author": "بيل غيتس",
    "color_id": 9
  },
  {
    "id": 37,
    "quote":
        " إذا كان المهوس يعني أنك على استعداد لدراسة الأشياء ، وإذا كنت تعتقد أن العلوم والهندسة مهمة ، فأنا أقر بالذنب. إذا كانت ثقافتك لا تحب المهوسين ، فلديك مشكلة حقيقية.",
    "author": "بيل غيتس",
    "color_id": 5
  },
  {
    "id": 38,
    "quote":
        " مفتاح النجاح في مجال الأعمال هو اكتشاف المكان الذي سيذهب إليه العالم أولاً.",
    "author": "بيل غيتس",
    "color_id": 4
  },
  {
    "id": 39,
    "quote": " إذا كنت تعتقد أن معلمك صعب ، انتظر حتى يكون لديك رئيس.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 40,
    "quote":
        " إذا كنت تفسد شيئًا ، فهذا ليس خطأ والديك ، لذا لا تشتكي من أخطائك ، فتعلم منها.",
    "author": "بيل غيتس",
    "color_id": 3
  },
  {
    "id": 41,
    "quote":
        " سيكون هناك نوعان من الأعمال في القرن الواحد والعشرين: تلك الموجودة على الإنترنت وتلك التي لم تعد موجودة.",
    "author": "بيل غيتس",
    "color_id": 6
  },
  {
    "id": 42,
    "quote":
        " من دوراتي العقلية ، أخصص 10٪ ربما للتفكير في الأعمال. الأعمال ليست معقدة.",
    "author": "بيل غيتس",
    "color_id": 0
  },
  {
    "id": 43,
    "quote": " ضع في اعتبارك أن \"المعلومات هي القوة\".",
    "author": "بيل غيتس",
    "color_id": 4
  },
  {
    "id": 44,
    "quote":
        " لن تكسب 5000 يورو شهريًا بعد مغادرة الجامعة ، ولن تكون نائبًا لرئيس أي شيء حتى تحصل على كل من الإنجازات بفضل مجهودك.",
    "author": "بيل غيتس",
    "color_id": 4
  },
  {
    "id": 45,
    "quote":
        " توفر الإنترنت المعلومات الصحيحة ، في الوقت المناسب ، للغرض المناسب.",
    "author": "بيل غيتس",
    "color_id": 5
  },
  {
    "id": 46,
    "quote":
        " ​​فشلت في بعض الامتحانات ، لكن شريكي مرر كل شيء. الآن هو مهندس Microsoft وأنا مالك Microsoft.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 47,
    "quote": " الإرث شيء غبي.لا أريد إرثًا.",
    "author": "بيل غيتس",
    "color_id": 1
  },
  {
    "id": 48,
    "quote": " إذا كنت لا تستطيع مع العدو ... شرائه!",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 49,
    "quote": " هذه الأشياء من الشبكات الاجتماعية تأخذك إلى أماكن مجنونة جداً.",
    "author": "بيل غيتس",
    "color_id": 2
  },
  {
    "id": 50,
    "quote":
        " كثيراً ما يطلب مني الناس شرح نجاح Microsoft. إنهم يريدون معرفة سر كيفية الانتقال من نشاط يوظف شخصين ويتطلب القليل من المال إلى شركة لديها أكثر من 21،000 موظف وفواتير تزيد على 8 مليارات دولار سنوياً. بالطبع ، لا توجد إجابة واحدة وقد تأثر الحظ جزئياً ، ولكن أعتقد أن أهم عنصر هو رؤيتنا الأصلية.",
    "author": "بيل غيتس",
    "color_id": 4
  }
];
